Repository: rinaldosbj/TheBridge
Catalog: TheBridge/Util/*.lproj/Localizable.strings
Languages: pt_br

source: Background sounds
pt_br: Som de fundo

source: Sound effects
pt_br: Efeitos

source: Credits
pt_br: Creditos

source: Hello!
pt_br: Olá!

source: Start
pt_br: Jogar

source: Save
pt_br: Salvar

source: Back
pt_br: Voltar

source: Back to Menu
pt_br: Voltar para o Menu

source: Buttons
pt_br: Botão

source: Chapter 1
pt_br: Capítulo 1

source: The cave
pt_br: A caverna

source: Chapter 2
pt_br: Capítulo 2

source: coming soon...
pt_br: em breve...

source: This is the story of this person.
pt_br: Essa é a história dessa pessoa

source: Person?
pt_br: Pessoa?

source: Well, I'm not sure how to define IT.
pt_br: Bem, eu não sei muito bem como defini-lo

source: Anyway...
pt_br: eh, então...

source: Everything was all very dark.
pt_br: Tudo estava escuro.

source: What a scary place...
pt_br: Que lugar assustador...

source: How scary!
pt_br: Que medo!

source: At least that will keep IT warm.
pt_br: Pelo menos isso vai deixa-lo mais quentinho.

source: Look! There's more than just darkness.
pt_br: Olha! Existe mais do que só escuridão.

source: IT is going really well!
pt_br: Está indo bem!

source: Apparently, there was nothing to fear.
pt_br: Aparentemente, não há nada a temer.

source: IT is almost there!
pt_br: Esrá quase lá!

source: Finally!
pt_br: Finalmente!

source: IT reached the top
pt_br: Chegou ao topo

source: Noooo!
pt_br: Nãooo!

source: Ouch!
pt_br: ai!

source: That hurts a lot!
pt_br: Essa doeu!

source: IT's hurt.
pt_br: Está machucado.

source: IT was so close!
pt_br: Estava tão perto!

source: IT's back where it started.
pt_br: Está de volta onde começou.

source: It's not fair, IT didn't deserve this
pt_br: Não é justo, não merecia isso

source: IT thinks about giving up.
pt_br: Ele pensa em desistir.

source: Wait a minute!
pt_br: Pera aí!

source: IT may be in the same place where he started...
pt_br: Ele pode estar no mesmo lugar que começou...

source: The surroundings are the same.
pt_br: O ambiente é o mesmo.

source: But he's not the same anymore!
pt_br: Mas ele não é!

source: HE changed!
pt_br: Ele mudou!

source: HE has grown!
pt_br: Ele cresceu!

source: HE learned!
pt_br: Ele aprendeu!

source: HE can do it!
pt_br: Ele CONSEGUE!

source: HE feels motivated now!
pt_br: Ele agora se sente motivado!

source: Wow!
pt_br: Uau!

source: The energy coming from him can transform the environment!
pt_br: A energia que emana dele pode transformar o ambiente!

source: He looks back on all he's been through.
pt_br: Ele olha para tudo que passou.

source: He feels satisfied now.
pt_br: e se sente satisfeito.

source: After everything he learned, he can do anything.
pt_br: Despois de tudo que aprendeu ele pode fazer qualquer coisa.

source: Help
pt_br: Ajuda

source: Help_label
pt_br: The Bridge é um jogo de plataforma. Na tela de configurações, você pode escolher um dos tipos de controle, Botões (recomendado para iPad) ou Joystick (recomendado para iPhone ou Mac). Para avançar no jogo, basta subir na direção das placas; aproveite o processo.

source: Creator
pt_br: • Criação, Desenvolvimento e Arte por Rinaldo da Silva Bento Junior

source: SoundDesign
pt_br: • Efeitos sonoros por Helton Yan do itch.io

source: Font
pt_br: • Fonte personalizada: PixelifySans-Regular por Stefie

source: License
pt_br: Mostrar licença ↓

source: Considerations
pt_br: Considerações

source: Declaration
pt_br: Eu gostaria de expressar minha imensa satisfação em criar este jogo. Entregá-lo em tão pouco tempo e com tão pouca experiência exigiu muito esforço e dedicação. Bem, meu nome é Rinaldo Junior, não sou designer nem um programador experiente, mas, como o personagem, estou em uma jornada de transformação. Ao longo da minha vida, enfrentei muitos obstáculos. Vindo de uma família com poucos privilégios, tive muita dificuldade para ter acesso a uma boa educação. Depois de muito esforço e determinação, tanto da minha parte quanto da minha família, consegui entrar na universidade, o que foi uma grande conquista. Mas, depois de um tempo, percebi que o que estava fazendo não era o que eu queria, já não estava gostando do curso, não era nada do que eu imaginava, e realmente pensei em desistir. No entanto, no ano passado, quando entrei na Apple Developer Academy, descobri minha paixão pela programação. Foi difícil, mas a cada tentativa, percebi que era realmente para mim, era o que eu queria fazer. No início deste ano, depois de muita reflexão, finalmente reuni coragem para recomeçar. Depois de mais de três anos estudando Engenharia de Produção, conversei com minha família, larguei o curso e iniciei minha jornada em Ciência da Computação, minha paixão. Foi um ponto de virada, e agora sinto que estou no caminho certo! Sinto que me encontrei novamente. Quando ouvi falar do Student Challenge, vi a oportunidade de contar minha história. Eu tinha a ideia, mas o problema era que nunca havia criado um jogo sozinho. Até brinquei com a criação de personagens de pixel art, mas nunca havia feito algo em uma escala tão grande e com tão pouco tempo. Mas novamente, reuni forças e decidi que não ficaria satisfeito até entregar este jogo. Foi realmente uma montanha enorme para escalar, mas isso não me desanimou. Afinal, quantas montanhas já subi até agora?
